---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet{System.String})
source: html/285c5806-127c-332a-090f-b48e228e0ed7.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	ISet<string> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.ISet < String >`)